stevenj/avr-libc3/include/avr/io/attiny40.h
/* ADC4 Digital input Disable */
typedef enum ADC_ADC5D_enum
{
    ADC_ADC5D_CLEAR_gc = (0x00), /* ADC4 Digital input Disable - CLEAR */
    ADC_ADC5D_SET_gc   = (0x20), /* ADC4 Digital input Disable - SET */
} ADC_ADC5D_t;

/* ADC3 Digital input Disable */
typedef enum ADC_ADC4D_enum
{
    ADC_ADC4D_CLEAR_gc = (0x00), /* ADC3 Digital input Disable - CLEAR */
    ADC_ADC4D_SET_gc   = (0x10), /* ADC3 Digital input Disable - SET */
} ADC_ADC4D_t;

/* AREF Digital Input Disable */
typedef enum ADC_ADC3D_enum
{
    ADC_ADC3D_CLEAR_gc = (0x00), /* AREF Digital Input Disable - CLEAR */
    ADC_ADC3D_SET_gc   = (0x08), /* AREF Digital Input Disable - SET */
} ADC_ADC3D_t;

/* ADC2 Digital input Disable */
typedef enum ADC_ADC2D_enum
{
    ADC_ADC2D_CLEAR_gc = (0x00), /* ADC2 Digital input Disable - CLEAR */
    ADC_ADC2D_SET_gc   = (0x04), /* ADC2 Digital input Disable - SET */
} ADC_ADC2D_t;

/* ADC1 Digital input Disable */
typedef enum ADC_ADC1D_enum
{
    ADC_ADC1D_CLEAR_gc = (0x00), /* ADC1 Digital input Disable - CLEAR */
    ADC_ADC1D_SET_gc   = (0x02), /* ADC1 Digital input Disable - SET */
} ADC_ADC1D_t;

/* ADC0 Digital input Disable */
typedef enum ADC_ADC0D_enum
{
    ADC_ADC0D_CLEAR_gc = (0x00), /* ADC0 Digital input Disable - CLEAR */
    ADC_ADC0D_SET_gc   = (0x01), /* ADC0 Digital input Disable - SET */
} ADC_ADC0D_t;

/*
--------------------------------------------------------------------------------
AC - Analog Comparator
--------------------------------------------------------------------------------
*/

typedef struct AC_struct
{
    register8_t rsv_0x00[19]; /* RESERVED REGISTER BLOCK */
    register8_t ACSRB;        /* Analog Comparator Control And Status Register B */
    register8_t ACSRA;        /* Analog Comparator Control And Status Register A */
} AC_t;


/* Hysteresis Select */
typedef enum AC_HSEL_enum
{
    AC_HSEL_CLEAR_gc = (0x00), /* Hysteresis Select - CLEAR */
    AC_HSEL_SET_gc   = (0x80), /* Hysteresis Select - SET */
} AC_HSEL_t;

/* Hysteresis Level */
typedef enum AC_HLEV_enum
{
    AC_HLEV_CLEAR_gc = (0x00), /* Hysteresis Level - CLEAR */
    AC_HLEV_SET_gc   = (0x40), /* Hysteresis Level - SET */
} AC_HLEV_t;

/* Analog Comparator Multiplexer Enable */
typedef enum AC_ACME_enum
{
    AC_ACME_CLEAR_gc = (0x00), /* Analog Comparator Multiplexer Enable - CLEAR */
    AC_ACME_SET_gc   = (0x04), /* Analog Comparator Multiplexer Enable - SET */
} AC_ACME_t;

/* Analog Comparator Disable */
typedef enum AC_ACD_enum
{
    AC_ACD_CLEAR_gc = (0x00), /* Analog Comparator Disable - CLEAR */
    AC_ACD_SET_gc   = (0x80), /* Analog Comparator Disable - SET */
} AC_ACD_t;

/* Analog Comparator Bandgap Select */
typedef enum AC_ACBG_enum
{
    AC_ACBG_CLEAR_gc = (0x00), /* Analog Comparator Bandgap Select - CLEAR */
    AC_ACBG_SET_gc   = (0x40), /* Analog Comparator Bandgap Select - SET */
} AC_ACBG_t;

/* Analog Compare Output */
typedef enum AC_ACO_enum
{
    AC_ACO_CLEAR_gc = (0x00), /* Analog Compare Output - CLEAR */
    AC_ACO_SET_gc   = (0x20), /* Analog Compare Output - SET */
} AC_ACO_t;

/* Analog Comparator Interrupt Flag */
typedef enum AC_ACI_enum
{
    AC_ACI_CLEAR_gc = (0x00), /* Analog Comparator Interrupt Flag - CLEAR */
    AC_ACI_SET_gc   = (0x10), /* Analog Comparator Interrupt Flag - SET */
} AC_ACI_t;

/* Analog Comparator Interrupt Enable */
typedef enum AC_ACIE_enum
{
    AC_ACIE_CLEAR_gc = (0x00), /* Analog Comparator Interrupt Enable - CLEAR */
    AC_ACIE_SET_gc   = (0x08), /* Analog Comparator Interrupt Enable - SET */
} AC_ACIE_t;

/* Analog Comparator Input Capture Enable */
typedef enum AC_ACIC_enum
{
    AC_ACIC_CLEAR_gc = (0x00), /* Analog Comparator Input Capture Enable - CLEAR */
    AC_ACIC_SET_gc   = (0x04), /* Analog Comparator Input Capture Enable - SET */
} AC_ACIC_t;

/* Analog Comparator Interrupt Mode Select bits */
typedef enum AC_ACIS_enum
{
    AC_ACIS_VAL_0x00_gc = (0x00), /* Interrupt on Toggle */
    AC_ACIS_VAL_0x01_gc = (0x01), /* Reserved */
    AC_ACIS_VAL_0x02_gc = (0x02), /* Interrupt on Falling Edge */
    AC_ACIS_VAL_0x03_gc = (0x03), /* Interrupt on Rising Edge */
} AC_ACIS_t;

/*
--------------------------------------------------------------------------------
TWI - Two Wire Serial Interface
--------------------------------------------------------------------------------
*/

typedef struct TWI_struct
{
    register8_t rsv_0x00[40]; /* RESERVED REGISTER BLOCK */
    register8_t TWSD;         /* TWI Slave Data Register */
    register8_t TWSAM;        /* TWI Slave Address Mask Register */
    register8_t TWSA;         /* TWI Slave Address Register */
    register8_t TWSSRA;       /* TWI Slave Status Register A */
    register8_t TWSCRB;       /* TWI Slave Control Register B */
    register8_t TWSCRA;       /* TWI Slave Control Register A */
} TWI_t;


/* TWI SDA Hold Time Enable */
typedef enum TWI_TWSHE_enum
{
    TWI_TWSHE_CLEAR_gc = (0x00), /* TWI SDA Hold Time Enable - CLEAR */
    TWI_TWSHE_SET_gc   = (0x80), /* TWI SDA Hold Time Enable - SET */
} TWI_TWSHE_t;

/* TWI Data Interrupt Enable */
typedef enum TWI_TWDIE_enum
{
    TWI_TWDIE_CLEAR_gc = (0x00), /* TWI Data Interrupt Enable - CLEAR */
    TWI_TWDIE_SET_gc   = (0x20), /* TWI Data Interrupt Enable - SET */
} TWI_TWDIE_t;

/* TWI Address/Stop Interrupt Enable */
typedef enum TWI_TWASIE_enum
{
    TWI_TWASIE_CLEAR_gc = (0x00), /* TWI Address/Stop Interrupt Enable - CLEAR */
    TWI_TWASIE_SET_gc   = (0x10), /* TWI Address/Stop Interrupt Enable - SET */
} TWI_TWASIE_t;

/* Two-Wire Interface Enable */
typedef enum TWI_TWEN_enum
{
    TWI_TWEN_CLEAR_gc = (0x00), /* Two-Wire Interface Enable - CLEAR */
    TWI_TWEN_SET_gc   = (0x08), /* Two-Wire Interface Enable - SET */
} TWI_TWEN_t;

/* TWI Stop Interrupt Enable */
typedef enum TWI_TWSIE_enum
{
    TWI_TWSIE_CLEAR_gc = (0x00), /* TWI Stop Interrupt Enable - CLEAR */
    TWI_TWSIE_SET_gc   = (0x04), /* TWI Stop Interrupt Enable - SET */
} TWI_TWSIE_t;

/* TWI Promiscuous Mode Enable */
typedef enum TWI_TWPME_enum
{
    TWI_TWPME_CLEAR_gc = (0x00), /* TWI Promiscuous Mode Enable - CLEAR */
    TWI_TWPME_SET_gc   = (0x02), /* TWI Promiscuous Mode Enable - SET */
} TWI_TWPME_t;

/* TWI Smart Mode Enable */
typedef enum TWI_TWSME_enum
{
    TWI_TWSME_CLEAR_gc = (0x00), /* TWI Smart Mode Enable - CLEAR */
    TWI_TWSME_SET_gc   = (0x01), /* TWI Smart Mode Enable - SET */
} TWI_TWSME_t;

