stevenj/avr-libc3/include/avr/io/attiny40.h
/* TWI Acknowledge Action */
typedef enum TWI_TWAA_enum
{
    TWI_TWAA_CLEAR_gc = (0x00), /* TWI Acknowledge Action - CLEAR */
    TWI_TWAA_SET_gc   = (0x04), /* TWI Acknowledge Action - SET */
} TWI_TWAA_t;

/* TWI Slave Control Register B-TWCMD */
#define TWI_TWSCRB_TWCMD_gc(x) (x & 0x03)

/* TWI Data Interrupt Flag */
typedef enum TWI_TWDIF_enum
{
    TWI_TWDIF_CLEAR_gc = (0x00), /* TWI Data Interrupt Flag - CLEAR */
    TWI_TWDIF_SET_gc   = (0x80), /* TWI Data Interrupt Flag - SET */
} TWI_TWDIF_t;

/* TWI Address/Stop Interrupt Flag */
typedef enum TWI_TWASIF_enum
{
    TWI_TWASIF_CLEAR_gc = (0x00), /* TWI Address/Stop Interrupt Flag - CLEAR */
    TWI_TWASIF_SET_gc   = (0x40), /* TWI Address/Stop Interrupt Flag - SET */
} TWI_TWASIF_t;

/* TWI Clock Hold */
typedef enum TWI_TWCH_enum
{
    TWI_TWCH_CLEAR_gc = (0x00), /* TWI Clock Hold - CLEAR */
    TWI_TWCH_SET_gc   = (0x20), /* TWI Clock Hold - SET */
} TWI_TWCH_t;

/* TWI Receive Acknowledge */
typedef enum TWI_TWRA_enum
{
    TWI_TWRA_CLEAR_gc = (0x00), /* TWI Receive Acknowledge - CLEAR */
    TWI_TWRA_SET_gc   = (0x10), /* TWI Receive Acknowledge - SET */
} TWI_TWRA_t;

/* TWI Collision */
typedef enum TWI_TWC_enum
{
    TWI_TWC_CLEAR_gc = (0x00), /* TWI Collision - CLEAR */
    TWI_TWC_SET_gc   = (0x08), /* TWI Collision - SET */
} TWI_TWC_t;

/* TWI Bus Error */
typedef enum TWI_TWBE_enum
{
    TWI_TWBE_CLEAR_gc = (0x00), /* TWI Bus Error - CLEAR */
    TWI_TWBE_SET_gc   = (0x04), /* TWI Bus Error - SET */
} TWI_TWBE_t;

/* TWI Read/Write Direction */
typedef enum TWI_TWDIR_enum
{
    TWI_TWDIR_CLEAR_gc = (0x00), /* TWI Read/Write Direction - CLEAR */
    TWI_TWDIR_SET_gc   = (0x02), /* TWI Read/Write Direction - SET */
} TWI_TWDIR_t;

/* TWI Address or Stop */
typedef enum TWI_TWAS_enum
{
    TWI_TWAS_CLEAR_gc = (0x00), /* TWI Address or Stop - CLEAR */
    TWI_TWAS_SET_gc   = (0x01), /* TWI Address or Stop - SET */
} TWI_TWAS_t;

/*
--------------------------------------------------------------------------------
CPU - CPU Registers
--------------------------------------------------------------------------------
*/

typedef struct CPU_struct
{
    register8_t rsv_0x00[31]; /* RESERVED REGISTER BLOCK */
    register8_t RAMDR;        /* RAM Data Register */
    register8_t RAMAR;        /* RAM Address Register */
    register8_t rsv_0x21[17]; /* RESERVED REGISTER BLOCK */
    register8_t NVMCSR;       /* Non-Volatile Memory Control and Status Register */
    register8_t NVMCMD;       /* Non-Volatile Memory Command */
    register8_t rsv_0x34;     /* RESERVED REGISTER */
    register8_t PRR;          /* Power Reduction Register */
    register8_t CLKPSR;       /* Clock Prescale Register */
    register8_t CLKMSR;       /* Clock Main Settings Register */
    register8_t rsv_0x38;     /* RESERVED REGISTER */
    register8_t OSCCAL;       /* Oscillator Calibration Value */
    register8_t MCUCR;        /* MCU Control Register */
    register8_t RSTFLR;       /* Reset Flag Register */
    register8_t CCP;          /* Configuration Change Protection */
    _REGISTER16 (SP);         /* Stack Pointer  */
    register8_t rsv_0x3E;     /* RESERVED REGISTER */
    register8_t SREG;         /* Status Register */
} CPU_t;


/* Global Interrupt Enable */
typedef enum CPU_I_enum
{
    CPU_I_CLEAR_gc = (0x00), /* Global Interrupt Enable - CLEAR */
    CPU_I_SET_gc   = (0x80), /* Global Interrupt Enable - SET */
} CPU_I_t;

/* Bit Copy Storage */
typedef enum CPU_T_enum
{
    CPU_T_CLEAR_gc = (0x00), /* Bit Copy Storage - CLEAR */
    CPU_T_SET_gc   = (0x40), /* Bit Copy Storage - SET */
} CPU_T_t;

/* Half Carry Flag */
typedef enum CPU_H_enum
{
    CPU_H_CLEAR_gc = (0x00), /* Half Carry Flag - CLEAR */
    CPU_H_SET_gc   = (0x20), /* Half Carry Flag - SET */
} CPU_H_t;

/* Sign Bit */
typedef enum CPU_S_enum
{
    CPU_S_CLEAR_gc = (0x00), /* Sign Bit - CLEAR */
    CPU_S_SET_gc   = (0x10), /* Sign Bit - SET */
} CPU_S_t;

/* Two's Complement Overflow Flag */
typedef enum CPU_V_enum
{
    CPU_V_CLEAR_gc = (0x00), /* Two's Complement Overflow Flag - CLEAR */
    CPU_V_SET_gc   = (0x08), /* Two's Complement Overflow Flag - SET */
} CPU_V_t;

/* Negative Flag */
typedef enum CPU_N_enum
{
    CPU_N_CLEAR_gc = (0x00), /* Negative Flag - CLEAR */
    CPU_N_SET_gc   = (0x04), /* Negative Flag - SET */
} CPU_N_t;

/* Zero Flag */
typedef enum CPU_Z_enum
{
    CPU_Z_CLEAR_gc = (0x00), /* Zero Flag - CLEAR */
    CPU_Z_SET_gc   = (0x02), /* Zero Flag - SET */
} CPU_Z_t;

/* Carry Flag */
typedef enum CPU_C_enum
{
    CPU_C_CLEAR_gc = (0x00), /* Carry Flag - CLEAR */
    CPU_C_SET_gc   = (0x01), /* Carry Flag - SET */
} CPU_C_t;

/* Clock Prescaler Select Bits */
typedef enum CPU_CLKPS_enum
{
    CPU_CLKPS_VAL_0x00_gc = (0x00), /* 1 */
    CPU_CLKPS_VAL_0x01_gc = (0x01), /* 2 */
    CPU_CLKPS_VAL_0x02_gc = (0x02), /* 4 */
    CPU_CLKPS_VAL_0x03_gc = (0x03), /* 8 */
    CPU_CLKPS_VAL_0x04_gc = (0x04), /* 16 */
    CPU_CLKPS_VAL_0x05_gc = (0x05), /* 32 */
    CPU_CLKPS_VAL_0x06_gc = (0x06), /* 64 */
    CPU_CLKPS_VAL_0x07_gc = (0x07), /* 128 */
    CPU_CLKPS_VAL_0x08_gc = (0x08), /* 256 */
} CPU_CLKPS_t;

/* Power Reduction TWI */
typedef enum CPU_PRTWI_enum
{
    CPU_PRTWI_CLEAR_gc = (0x00), /* Power Reduction TWI - CLEAR */
    CPU_PRTWI_SET_gc   = (0x10), /* Power Reduction TWI - SET */
} CPU_PRTWI_t;

/* Power Reduction Serial Peripheral Interface */
typedef enum CPU_PRSPI_enum
{
    CPU_PRSPI_CLEAR_gc = (0x00), /* Power Reduction Serial Peripheral Interface - CLEAR */
    CPU_PRSPI_SET_gc   = (0x08), /* Power Reduction Serial Peripheral Interface - SET */
} CPU_PRSPI_t;

/* Power Reduction Timer/Counter1 */
typedef enum CPU_PRTIM1_enum
{
    CPU_PRTIM1_CLEAR_gc = (0x00), /* Power Reduction Timer/Counter1 - CLEAR */
    CPU_PRTIM1_SET_gc   = (0x04), /* Power Reduction Timer/Counter1 - SET */
} CPU_PRTIM1_t;

/* Power Reduction Timer/Counter0 */
typedef enum CPU_PRTIM0_enum
{
    CPU_PRTIM0_CLEAR_gc = (0x00), /* Power Reduction Timer/Counter0 - CLEAR */
    CPU_PRTIM0_SET_gc   = (0x02), /* Power Reduction Timer/Counter0 - SET */
} CPU_PRTIM0_t;

/* Power Reduction ADC */
typedef enum CPU_PRADC_enum
{
    CPU_PRADC_CLEAR_gc = (0x00), /* Power Reduction ADC - CLEAR */
    CPU_PRADC_SET_gc   = (0x01), /* Power Reduction ADC - SET */
} CPU_PRADC_t;

