stevenj/avr-libc3/include/avr/io/attiny40.h
/* Watchdog Reset Flag */
typedef enum CPU_WDRF_enum
{
    CPU_WDRF_CLEAR_gc = (0x00), /* Watchdog Reset Flag - CLEAR */
    CPU_WDRF_SET_gc   = (0x08), /* Watchdog Reset Flag - SET */
} CPU_WDRF_t;

/* External Reset Flag */
typedef enum CPU_EXTRF_enum
{
    CPU_EXTRF_CLEAR_gc = (0x00), /* External Reset Flag - CLEAR */
    CPU_EXTRF_SET_gc   = (0x02), /* External Reset Flag - SET */
} CPU_EXTRF_t;

/* Power-on Reset Flag */
typedef enum CPU_PORF_enum
{
    CPU_PORF_CLEAR_gc = (0x00), /* Power-on Reset Flag - CLEAR */
    CPU_PORF_SET_gc   = (0x01), /* Power-on Reset Flag - SET */
} CPU_PORF_t;

/* Non-Volatile Memory Busy */
typedef enum CPU_NVMBSY_enum
{
    CPU_NVMBSY_CLEAR_gc = (0x00), /* Non-Volatile Memory Busy - CLEAR */
    CPU_NVMBSY_SET_gc   = (0x80), /* Non-Volatile Memory Busy - SET */
} CPU_NVMBSY_t;

/* BOD Sleep */
typedef enum CPU_BODS_enum
{
    CPU_BODS_CLEAR_gc = (0x00), /* BOD Sleep - CLEAR */
    CPU_BODS_SET_gc   = (0x10), /* BOD Sleep - SET */
} CPU_BODS_t;

/* Sleep Mode */
typedef enum CPU_SM_enum
{
    CPU_SM_IDLE_gc  = (0x00<<1), /* Idle */
    CPU_SM_ADC_gc   = (0x01<<1), /* ADC noise reduction */
    CPU_SM_PDOWN_gc = (0x02<<1), /* Power-down */
    CPU_SM_STDBY_gc = (0x04<<1), /* Standby */
} CPU_SM_t;

/* Sleep Enable */
typedef enum CPU_SE_enum
{
    CPU_SE_CLEAR_gc = (0x00), /* Sleep Enable - CLEAR */
    CPU_SE_SET_gc   = (0x01), /* Sleep Enable - SET */
} CPU_SE_t;

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[9];  /* RESERVED REGISTER BLOCK */
    register8_t PCMSK0;       /* Pin Change Mask Register 0 */
    register8_t PCMSK1;       /* Pin Change Mask Register 1 */
    register8_t GIFR;         /* General Interrupt Flag Register */
    register8_t GIMSK;        /* General Interrupt Mask Register */
    register8_t rsv_0x0D[13]; /* RESERVED REGISTER BLOCK */
    register8_t PCMSK2;       /* Pin Change Mask Register 2 */
    register8_t rsv_0x1B[31]; /* RESERVED REGISTER BLOCK */
    register8_t MCUCR;        /* MCU Control Register */
} EXINT_t;


/* Interrupt Sense Control 0 Bit 1 */
typedef enum EXINT_ISC01_enum
{
    EXINT_ISC01_CLEAR_gc = (0x00), /* Interrupt Sense Control 0 Bit 1 - CLEAR */
    EXINT_ISC01_SET_gc   = (0x80), /* Interrupt Sense Control 0 Bit 1 - SET */
} EXINT_ISC01_t;

/* Interrupt Sense Control 0 Bit 0 */
typedef enum EXINT_ISC00_enum
{
    EXINT_ISC00_VAL_0x00_gc = (0x00<<6), /* Low Level of INTX */
    EXINT_ISC00_VAL_0x01_gc = (0x01<<6), /* Any logical change on INTX */
    EXINT_ISC00_VAL_0x02_gc = (0x02<<6), /* Falling Edge of INTX */
    EXINT_ISC00_VAL_0x03_gc = (0x03<<6), /* Rising Edge of INTX */
} EXINT_ISC00_t;

/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x01), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* Pin Change Interrupt Enables */
#define EXINT_GIMSK_PCIE_gc(x) ((x<<4) & 0x70)

/* External Interrupt Flag 0 */
typedef enum EXINT_INTF0_enum
{
    EXINT_INTF0_CLEAR_gc = (0x00), /* External Interrupt Flag 0 - CLEAR */
    EXINT_INTF0_SET_gc   = (0x01), /* External Interrupt Flag 0 - SET */
} EXINT_INTF0_t;

/* Pin Change Interrupt Flags */
#define EXINT_GIFR_PCIF_gc(x) ((x<<4) & 0x70)

/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTB_struct
{
    register8_t rsv_0x00[4]; /* RESERVED REGISTER BLOCK */
    register8_t PINB;        /* Port B Data register */
    register8_t DDRB;        /* Data Direction Register, Port B */
    register8_t PORTB;       /* Input Pins, Port B */
    register8_t PUEB;        /* Pull-up Enable Control Register */
    register8_t PORTCR;      /* Port Control Register */
} PORTB_t;


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTC_struct
{
    register8_t rsv_0x00[8];  /* RESERVED REGISTER BLOCK */
    register8_t PORTCR;       /* Port Control Register */
    register8_t rsv_0x09[18]; /* RESERVED REGISTER BLOCK */
    register8_t PINC;         /* Port C Input Pins */
    register8_t DDRC;         /* Data Direction Register, Port C */
    register8_t PORTC;        /* Port C Data Register */
    register8_t PUEC;         /* Pull-up Enable Control Register */
} PORTC_t;


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTA_struct
{
    register8_t PINA;        /* Port A Input Pins */
    register8_t DDRA;        /* Data Direction Register, Port A */
    register8_t PORTA;       /* Port A Data Register */
    register8_t PUEA;        /* Pull-up Enable Control Register */
    register8_t rsv_0x04[4]; /* RESERVED REGISTER BLOCK */
    register8_t PORTCR;      /* Port Control Register */
} PORTA_t;


/* Port Control Register-ADC11D */
typedef enum PORTB_ADC11D_enum
{
    PORTB_ADC11D_CLEAR_gc = (0x00), /* Port Control Register-ADC11D - CLEAR */
    PORTB_ADC11D_SET_gc   = (0x80), /* Port Control Register-ADC11D - SET */
} PORTB_ADC11D_t;

/* Port Control Register-ADC10D */
typedef enum PORTB_ADC10D_enum
{
    PORTB_ADC10D_CLEAR_gc = (0x00), /* Port Control Register-ADC10D - CLEAR */
    PORTB_ADC10D_SET_gc   = (0x40), /* Port Control Register-ADC10D - SET */
} PORTB_ADC10D_t;

/* Port Control Register-ADC9D */
typedef enum PORTB_ADC9D_enum
{
    PORTB_ADC9D_CLEAR_gc = (0x00), /* Port Control Register-ADC9D - CLEAR */
    PORTB_ADC9D_SET_gc   = (0x20), /* Port Control Register-ADC9D - SET */
} PORTB_ADC9D_t;

/* Port Control Register-ADC8D */
typedef enum PORTB_ADC8D_enum
{
    PORTB_ADC8D_CLEAR_gc = (0x00), /* Port Control Register-ADC8D - CLEAR */
    PORTB_ADC8D_SET_gc   = (0x10), /* Port Control Register-ADC8D - SET */
} PORTB_ADC8D_t;

/* Break-Before-Make Mode Enable */
typedef enum PORTB_BBMC_enum
{
    PORTB_BBMC_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable - CLEAR */
    PORTB_BBMC_SET_gc   = (0x04), /* Break-Before-Make Mode Enable - SET */
} PORTB_BBMC_t;

/* Break-Before-Make Mode Enable */
typedef enum PORTB_BBMB_enum
{
    PORTB_BBMB_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable - CLEAR */
    PORTB_BBMB_SET_gc   = (0x02), /* Break-Before-Make Mode Enable - SET */
} PORTB_BBMB_t;

/* Break-Before-Make Mode Enable */
typedef enum PORTB_BBMA_enum
{
    PORTB_BBMA_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable - CLEAR */
    PORTB_BBMA_SET_gc   = (0x01), /* Break-Before-Make Mode Enable - SET */
} PORTB_BBMA_t;

/* Port Control Register-ADC11D */
typedef enum PORTC_ADC11D_enum
{
    PORTC_ADC11D_CLEAR_gc = (0x00), /* Port Control Register-ADC11D - CLEAR */
    PORTC_ADC11D_SET_gc   = (0x80), /* Port Control Register-ADC11D - SET */
} PORTC_ADC11D_t;

/* Port Control Register-ADC10D */
typedef enum PORTC_ADC10D_enum
{
    PORTC_ADC10D_CLEAR_gc = (0x00), /* Port Control Register-ADC10D - CLEAR */
    PORTC_ADC10D_SET_gc   = (0x40), /* Port Control Register-ADC10D - SET */
} PORTC_ADC10D_t;

/* Port Control Register-ADC9D */
typedef enum PORTC_ADC9D_enum
{
    PORTC_ADC9D_CLEAR_gc = (0x00), /* Port Control Register-ADC9D - CLEAR */
    PORTC_ADC9D_SET_gc   = (0x20), /* Port Control Register-ADC9D - SET */
} PORTC_ADC9D_t;

/* Port Control Register-ADC8D */
typedef enum PORTC_ADC8D_enum
{
    PORTC_ADC8D_CLEAR_gc = (0x00), /* Port Control Register-ADC8D - CLEAR */
    PORTC_ADC8D_SET_gc   = (0x10), /* Port Control Register-ADC8D - SET */
} PORTC_ADC8D_t;

/* Break-Before-Make Mode Enable */
typedef enum PORTC_BBMC_enum
{
    PORTC_BBMC_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable - CLEAR */
    PORTC_BBMC_SET_gc   = (0x04), /* Break-Before-Make Mode Enable - SET */
} PORTC_BBMC_t;

/* Break-Before-Make Mode Enable */
typedef enum PORTA_BBMA_enum
{
    PORTA_BBMA_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable - CLEAR */
    PORTA_BBMA_SET_gc   = (0x01), /* Break-Before-Make Mode Enable - SET */
} PORTA_BBMA_t;

