stevenj/avr-libc3/include/avr/io/attiny40.h
/* Analog Comparator Interrupt Mode Select bits */
#define AC_ACIS_VAL_0x00_gc (0x00) /* Interrupt on Toggle */
#define AC_ACIS_VAL_0x01_gc (0x01) /* Reserved */
#define AC_ACIS_VAL_0x02_gc (0x02) /* Interrupt on Falling Edge */
#define AC_ACIS_VAL_0x03_gc (0x03) /* Interrupt on Rising Edge */


/*
--------------------------------------------------------------------------------
TWI - Two Wire Serial Interface
--------------------------------------------------------------------------------
*/


/* TWI SDA Hold Time Enable */
#define TWI_TWSHE_CLEAR_gc (0x00) /* TWI SDA Hold Time Enable - CLEAR */
#define TWI_TWSHE_SET_gc   (0x80) /* TWI SDA Hold Time Enable - SET */


/* TWI Data Interrupt Enable */
#define TWI_TWDIE_CLEAR_gc (0x00) /* TWI Data Interrupt Enable - CLEAR */
#define TWI_TWDIE_SET_gc   (0x20) /* TWI Data Interrupt Enable - SET */


/* TWI Address/Stop Interrupt Enable */
#define TWI_TWASIE_CLEAR_gc (0x00) /* TWI Address/Stop Interrupt Enable - CLEAR */
#define TWI_TWASIE_SET_gc   (0x10) /* TWI Address/Stop Interrupt Enable - SET */


/* Two-Wire Interface Enable */
#define TWI_TWEN_CLEAR_gc (0x00) /* Two-Wire Interface Enable - CLEAR */
#define TWI_TWEN_SET_gc   (0x08) /* Two-Wire Interface Enable - SET */


/* TWI Stop Interrupt Enable */
#define TWI_TWSIE_CLEAR_gc (0x00) /* TWI Stop Interrupt Enable - CLEAR */
#define TWI_TWSIE_SET_gc   (0x04) /* TWI Stop Interrupt Enable - SET */


/* TWI Promiscuous Mode Enable */
#define TWI_TWPME_CLEAR_gc (0x00) /* TWI Promiscuous Mode Enable - CLEAR */
#define TWI_TWPME_SET_gc   (0x02) /* TWI Promiscuous Mode Enable - SET */


/* TWI Smart Mode Enable */
#define TWI_TWSME_CLEAR_gc (0x00) /* TWI Smart Mode Enable - CLEAR */
#define TWI_TWSME_SET_gc   (0x01) /* TWI Smart Mode Enable - SET */


/* TWI Acknowledge Action */
#define TWI_TWAA_CLEAR_gc (0x00) /* TWI Acknowledge Action - CLEAR */
#define TWI_TWAA_SET_gc   (0x04) /* TWI Acknowledge Action - SET */


/* TWI Slave Control Register B-TWCMD */
#define TWI_TWSCRB_TWCMD_gc(x) (x & 0x03)

/* TWI Data Interrupt Flag */
#define TWI_TWDIF_CLEAR_gc (0x00) /* TWI Data Interrupt Flag - CLEAR */
#define TWI_TWDIF_SET_gc   (0x80) /* TWI Data Interrupt Flag - SET */


/* TWI Address/Stop Interrupt Flag */
#define TWI_TWASIF_CLEAR_gc (0x00) /* TWI Address/Stop Interrupt Flag - CLEAR */
#define TWI_TWASIF_SET_gc   (0x40) /* TWI Address/Stop Interrupt Flag - SET */


/* TWI Clock Hold */
#define TWI_TWCH_CLEAR_gc (0x00) /* TWI Clock Hold - CLEAR */
#define TWI_TWCH_SET_gc   (0x20) /* TWI Clock Hold - SET */


/* TWI Receive Acknowledge */
#define TWI_TWRA_CLEAR_gc (0x00) /* TWI Receive Acknowledge - CLEAR */
#define TWI_TWRA_SET_gc   (0x10) /* TWI Receive Acknowledge - SET */


/* TWI Collision */
#define TWI_TWC_CLEAR_gc (0x00) /* TWI Collision - CLEAR */
#define TWI_TWC_SET_gc   (0x08) /* TWI Collision - SET */


/* TWI Bus Error */
#define TWI_TWBE_CLEAR_gc (0x00) /* TWI Bus Error - CLEAR */
#define TWI_TWBE_SET_gc   (0x04) /* TWI Bus Error - SET */


/* TWI Read/Write Direction */
#define TWI_TWDIR_CLEAR_gc (0x00) /* TWI Read/Write Direction - CLEAR */
#define TWI_TWDIR_SET_gc   (0x02) /* TWI Read/Write Direction - SET */


/* TWI Address or Stop */
#define TWI_TWAS_CLEAR_gc (0x00) /* TWI Address or Stop - CLEAR */
#define TWI_TWAS_SET_gc   (0x01) /* TWI Address or Stop - SET */


/*
--------------------------------------------------------------------------------
CPU - CPU Registers
--------------------------------------------------------------------------------
*/


/* Global Interrupt Enable */
#define CPU_I_CLEAR_gc (0x00) /* Global Interrupt Enable - CLEAR */
#define CPU_I_SET_gc   (0x80) /* Global Interrupt Enable - SET */


/* Bit Copy Storage */
#define CPU_T_CLEAR_gc (0x00) /* Bit Copy Storage - CLEAR */
#define CPU_T_SET_gc   (0x40) /* Bit Copy Storage - SET */


/* Half Carry Flag */
#define CPU_H_CLEAR_gc (0x00) /* Half Carry Flag - CLEAR */
#define CPU_H_SET_gc   (0x20) /* Half Carry Flag - SET */


/* Sign Bit */
#define CPU_S_CLEAR_gc (0x00) /* Sign Bit - CLEAR */
#define CPU_S_SET_gc   (0x10) /* Sign Bit - SET */


/* Two's Complement Overflow Flag */
#define CPU_V_CLEAR_gc (0x00) /* Two's Complement Overflow Flag - CLEAR */
#define CPU_V_SET_gc   (0x08) /* Two's Complement Overflow Flag - SET */


/* Negative Flag */
#define CPU_N_CLEAR_gc (0x00) /* Negative Flag - CLEAR */
#define CPU_N_SET_gc   (0x04) /* Negative Flag - SET */


/* Zero Flag */
#define CPU_Z_CLEAR_gc (0x00) /* Zero Flag - CLEAR */
#define CPU_Z_SET_gc   (0x02) /* Zero Flag - SET */


/* Carry Flag */
#define CPU_C_CLEAR_gc (0x00) /* Carry Flag - CLEAR */
#define CPU_C_SET_gc   (0x01) /* Carry Flag - SET */


/* Clock Prescaler Select Bits */
#define CPU_CLKPS_VAL_0x00_gc (0x00) /* 1 */
#define CPU_CLKPS_VAL_0x01_gc (0x01) /* 2 */
#define CPU_CLKPS_VAL_0x02_gc (0x02) /* 4 */
#define CPU_CLKPS_VAL_0x03_gc (0x03) /* 8 */
#define CPU_CLKPS_VAL_0x04_gc (0x04) /* 16 */
#define CPU_CLKPS_VAL_0x05_gc (0x05) /* 32 */
#define CPU_CLKPS_VAL_0x06_gc (0x06) /* 64 */
#define CPU_CLKPS_VAL_0x07_gc (0x07) /* 128 */
#define CPU_CLKPS_VAL_0x08_gc (0x08) /* 256 */


/* Power Reduction TWI */
#define CPU_PRTWI_CLEAR_gc (0x00) /* Power Reduction TWI - CLEAR */
#define CPU_PRTWI_SET_gc   (0x10) /* Power Reduction TWI - SET */


/* Power Reduction Serial Peripheral Interface */
#define CPU_PRSPI_CLEAR_gc (0x00) /* Power Reduction Serial Peripheral Interface - CLEAR */
#define CPU_PRSPI_SET_gc   (0x08) /* Power Reduction Serial Peripheral Interface - SET */


/* Power Reduction Timer/Counter1 */
#define CPU_PRTIM1_CLEAR_gc (0x00) /* Power Reduction Timer/Counter1 - CLEAR */
#define CPU_PRTIM1_SET_gc   (0x04) /* Power Reduction Timer/Counter1 - SET */


/* Power Reduction Timer/Counter0 */
#define CPU_PRTIM0_CLEAR_gc (0x00) /* Power Reduction Timer/Counter0 - CLEAR */
#define CPU_PRTIM0_SET_gc   (0x02) /* Power Reduction Timer/Counter0 - SET */


/* Power Reduction ADC */
#define CPU_PRADC_CLEAR_gc (0x00) /* Power Reduction ADC - CLEAR */
#define CPU_PRADC_SET_gc   (0x01) /* Power Reduction ADC - SET */


