stevenj/avr-libc3/include/avr/io/attiny40.h
/* Watchdog Reset Flag */
#define CPU_WDRF_CLEAR_gc (0x00) /* Watchdog Reset Flag - CLEAR */
#define CPU_WDRF_SET_gc   (0x08) /* Watchdog Reset Flag - SET */


/* External Reset Flag */
#define CPU_EXTRF_CLEAR_gc (0x00) /* External Reset Flag - CLEAR */
#define CPU_EXTRF_SET_gc   (0x02) /* External Reset Flag - SET */


/* Power-on Reset Flag */
#define CPU_PORF_CLEAR_gc (0x00) /* Power-on Reset Flag - CLEAR */
#define CPU_PORF_SET_gc   (0x01) /* Power-on Reset Flag - SET */


/* Non-Volatile Memory Busy */
#define CPU_NVMBSY_CLEAR_gc (0x00) /* Non-Volatile Memory Busy - CLEAR */
#define CPU_NVMBSY_SET_gc   (0x80) /* Non-Volatile Memory Busy - SET */


/* BOD Sleep */
#define CPU_BODS_CLEAR_gc (0x00) /* BOD Sleep - CLEAR */
#define CPU_BODS_SET_gc   (0x10) /* BOD Sleep - SET */


/* Sleep Mode */
#define CPU_SM_IDLE_gc  (0x00<<1) /* Idle */
#define CPU_SM_ADC_gc   (0x01<<1) /* ADC noise reduction */
#define CPU_SM_PDOWN_gc (0x02<<1) /* Power-down */
#define CPU_SM_STDBY_gc (0x04<<1) /* Standby */


/* Sleep Enable */
#define CPU_SE_CLEAR_gc (0x00) /* Sleep Enable - CLEAR */
#define CPU_SE_SET_gc   (0x01) /* Sleep Enable - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* Interrupt Sense Control 0 Bit 1 */
#define EXINT_ISC01_CLEAR_gc (0x00) /* Interrupt Sense Control 0 Bit 1 - CLEAR */
#define EXINT_ISC01_SET_gc   (0x80) /* Interrupt Sense Control 0 Bit 1 - SET */


/* Interrupt Sense Control 0 Bit 0 */
#define EXINT_ISC00_VAL_0x00_gc (0x00<<6) /* Low Level of INTX */
#define EXINT_ISC00_VAL_0x01_gc (0x01<<6) /* Any logical change on INTX */
#define EXINT_ISC00_VAL_0x02_gc (0x02<<6) /* Falling Edge of INTX */
#define EXINT_ISC00_VAL_0x03_gc (0x03<<6) /* Rising Edge of INTX */


/* External Interrupt Request 0 Enable */
#define EXINT_INT0_CLEAR_gc (0x00) /* External Interrupt Request 0 Enable - CLEAR */
#define EXINT_INT0_SET_gc   (0x01) /* External Interrupt Request 0 Enable - SET */


/* Pin Change Interrupt Enables */
#define EXINT_GIMSK_PCIE_gc(x) ((x<<4) & 0x70)

/* External Interrupt Flag 0 */
#define EXINT_INTF0_CLEAR_gc (0x00) /* External Interrupt Flag 0 - CLEAR */
#define EXINT_INTF0_SET_gc   (0x01) /* External Interrupt Flag 0 - SET */


/* Pin Change Interrupt Flags */
#define EXINT_GIFR_PCIF_gc(x) ((x<<4) & 0x70)

/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/* Port Control Register-ADC11D */
#define PORTB_ADC11D_CLEAR_gc (0x00) /* Port Control Register-ADC11D - CLEAR */
#define PORTB_ADC11D_SET_gc   (0x80) /* Port Control Register-ADC11D - SET */


/* Port Control Register-ADC10D */
#define PORTB_ADC10D_CLEAR_gc (0x00) /* Port Control Register-ADC10D - CLEAR */
#define PORTB_ADC10D_SET_gc   (0x40) /* Port Control Register-ADC10D - SET */


/* Port Control Register-ADC9D */
#define PORTB_ADC9D_CLEAR_gc (0x00) /* Port Control Register-ADC9D - CLEAR */
#define PORTB_ADC9D_SET_gc   (0x20) /* Port Control Register-ADC9D - SET */


/* Port Control Register-ADC8D */
#define PORTB_ADC8D_CLEAR_gc (0x00) /* Port Control Register-ADC8D - CLEAR */
#define PORTB_ADC8D_SET_gc   (0x10) /* Port Control Register-ADC8D - SET */


/* Break-Before-Make Mode Enable */
#define PORTB_BBMC_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable - CLEAR */
#define PORTB_BBMC_SET_gc   (0x04) /* Break-Before-Make Mode Enable - SET */


/* Break-Before-Make Mode Enable */
#define PORTB_BBMB_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable - CLEAR */
#define PORTB_BBMB_SET_gc   (0x02) /* Break-Before-Make Mode Enable - SET */


/* Break-Before-Make Mode Enable */
#define PORTB_BBMA_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable - CLEAR */
#define PORTB_BBMA_SET_gc   (0x01) /* Break-Before-Make Mode Enable - SET */


/* Port Control Register-ADC11D */
#define PORTC_ADC11D_CLEAR_gc (0x00) /* Port Control Register-ADC11D - CLEAR */
#define PORTC_ADC11D_SET_gc   (0x80) /* Port Control Register-ADC11D - SET */


/* Port Control Register-ADC10D */
#define PORTC_ADC10D_CLEAR_gc (0x00) /* Port Control Register-ADC10D - CLEAR */
#define PORTC_ADC10D_SET_gc   (0x40) /* Port Control Register-ADC10D - SET */


/* Port Control Register-ADC9D */
#define PORTC_ADC9D_CLEAR_gc (0x00) /* Port Control Register-ADC9D - CLEAR */
#define PORTC_ADC9D_SET_gc   (0x20) /* Port Control Register-ADC9D - SET */


/* Port Control Register-ADC8D */
#define PORTC_ADC8D_CLEAR_gc (0x00) /* Port Control Register-ADC8D - CLEAR */
#define PORTC_ADC8D_SET_gc   (0x10) /* Port Control Register-ADC8D - SET */


/* Break-Before-Make Mode Enable */
#define PORTC_BBMC_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable - CLEAR */
#define PORTC_BBMC_SET_gc   (0x04) /* Break-Before-Make Mode Enable - SET */


/* Break-Before-Make Mode Enable */
#define PORTA_BBMA_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable - CLEAR */
#define PORTA_BBMA_SET_gc   (0x01) /* Break-Before-Make Mode Enable - SET */


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/* Compare Output Mode for Channel A bits */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode for Channel B bits */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Force Output Compare A */
#define TC0_FOC0A_CLEAR_gc (0x00) /* Force Output Compare A - CLEAR */
#define TC0_FOC0A_SET_gc   (0x80) /* Force Output Compare A - SET */


