stevenj/avr-libc3/include/avr/io/attiny40.h
/* Force Output Compare B */
#define TC0_FOC0B_CLEAR_gc (0x00) /* Force Output Compare B - CLEAR */
#define TC0_FOC0B_SET_gc   (0x40) /* Force Output Compare B - SET */


/* Timer/Counter Synchronization Mode */
#define TC0_TSM_CLEAR_gc (0x00) /* Timer/Counter Synchronization Mode - CLEAR */
#define TC0_TSM_SET_gc   (0x20) /* Timer/Counter Synchronization Mode - SET */


/* Prescaler Reset Timer/Counter */
#define TC0_PSR_CLEAR_gc (0x00) /* Prescaler Reset Timer/Counter - CLEAR */
#define TC0_PSR_SET_gc   (0x10) /* Prescaler Reset Timer/Counter - SET */


/* Waveform Generation Mode */
#define TC0_WGM02_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC0_WGM02_SET_gc   (0x08) /* Waveform Generation Mode - SET */


/* Clock Select */
#define TC0_CS0_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC0_CS0_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC0_CS0_VAL_0x02_gc (0x02) /* Running, CLK/8 */
#define TC0_CS0_VAL_0x03_gc (0x03) /* Running, CLK/64 */
#define TC0_CS0_VAL_0x04_gc (0x04) /* Running, CLK/256 */
#define TC0_CS0_VAL_0x05_gc (0x05) /* Running, CLK/1024 */
#define TC0_CS0_VAL_0x06_gc (0x06) /* Running, ExtClk Tx Falling Edge */
#define TC0_CS0_VAL_0x07_gc (0x07) /* Running, ExtClk Tx Rising Edge */


/* Timer/Counter1 Width */
#define TC0_TCW1_CLEAR_gc (0x00) /* Timer/Counter1 Width - CLEAR */
#define TC0_TCW1_SET_gc   (0x80) /* Timer/Counter1 Width - SET */


/* Input Capture Mode Enable */
#define TC0_ICEN1_CLEAR_gc (0x00) /* Input Capture Mode Enable - CLEAR */
#define TC0_ICEN1_SET_gc   (0x40) /* Input Capture Mode Enable - SET */


/* : Input Capture Noise Canceler */
#define TC0_ICNC1_CLEAR_gc (0x00) /* : Input Capture Noise Canceler - CLEAR */
#define TC0_ICNC1_SET_gc   (0x20) /* : Input Capture Noise Canceler - SET */


/* Input Capture Edge Select */
#define TC0_ICES1_CLEAR_gc (0x00) /* Input Capture Edge Select - CLEAR */
#define TC0_ICES1_SET_gc   (0x10) /* Input Capture Edge Select - SET */


/* Waveform Generation Mode */
#define TC0_CTC1_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC0_CTC1_SET_gc   (0x08) /* Waveform Generation Mode - SET */


/* The Clock Select1 bits 2, 1, and 0 define the prescaling source of Timer1. */
#define TC0_TCCR1A_CS1_gc(x) (x & 0x07)

/* Input Capture Interrupt Enable */
#define TC0_ICIE1_CLEAR_gc (0x00) /* Input Capture Interrupt Enable - CLEAR */
#define TC0_ICIE1_SET_gc   (0x80) /* Input Capture Interrupt Enable - SET */


/* Output Compare B Match Interrupt Enable */
#define TC0_OCIE1B_CLEAR_gc (0x00) /* Output Compare B Match Interrupt Enable - CLEAR */
#define TC0_OCIE1B_SET_gc   (0x20) /* Output Compare B Match Interrupt Enable - SET */


/* Output Compare A Match Interrupt Enable */
#define TC0_OCIE1A_CLEAR_gc (0x00) /* Output Compare A Match Interrupt Enable - CLEAR */
#define TC0_OCIE1A_SET_gc   (0x10) /* Output Compare A Match Interrupt Enable - SET */


/* Overflow Interrupt Enable */
#define TC0_TIMSK_TOIE_gc(x) (x & 0x09)

/* Timer/Counter Output Compare Match B Interrupt Enable */
#define TC0_OCIE0B_CLEAR_gc (0x00) /* Timer/Counter Output Compare Match B Interrupt Enable - CLEAR */
#define TC0_OCIE0B_SET_gc   (0x04) /* Timer/Counter Output Compare Match B Interrupt Enable - SET */


/* Timer/Counter0 Output Compare Match A Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Match A Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x02) /* Timer/Counter0 Output Compare Match A Interrupt Enable - SET */


/* Input Capture Flag */
#define TC0_ICF1_CLEAR_gc (0x00) /* Input Capture Flag - CLEAR */
#define TC0_ICF1_SET_gc   (0x80) /* Input Capture Flag - SET */


/* Timer Output Compare Flag 1B */
#define TC0_OCF1B_CLEAR_gc (0x00) /* Timer Output Compare Flag 1B - CLEAR */
#define TC0_OCF1B_SET_gc   (0x20) /* Timer Output Compare Flag 1B - SET */


/* Timer Output Compare Flag 1A */
#define TC0_OCF1A_CLEAR_gc (0x00) /* Timer Output Compare Flag 1A - CLEAR */
#define TC0_OCF1A_SET_gc   (0x10) /* Timer Output Compare Flag 1A - SET */


/* Timer Overflow Flag */
#define TC0_TIFR_TOV_gc(x) (x & 0x09)

/* Output Compare Flag 0 B */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Output Compare Flag 0 B - CLEAR */
#define TC0_OCF0B_SET_gc   (0x04) /* Output Compare Flag 0 B - SET */


/* Output Compare Flag 0 A */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Output Compare Flag 0 A - CLEAR */
#define TC0_OCF0A_SET_gc   (0x02) /* Output Compare Flag 0 A - SET */


/*
--------------------------------------------------------------------------------
SPI - Serial Peripheral Interface
--------------------------------------------------------------------------------
*/


/* SPI Interrupt Enable */
#define SPI_SPIE_CLEAR_gc (0x00) /* SPI Interrupt Enable - CLEAR */
#define SPI_SPIE_SET_gc   (0x80) /* SPI Interrupt Enable - SET */


/* SPI Enable */
#define SPI_SPE_CLEAR_gc (0x00) /* SPI Enable - CLEAR */
#define SPI_SPE_SET_gc   (0x40) /* SPI Enable - SET */


/* Data Order */
#define SPI_DORD_CLEAR_gc (0x00) /* Data Order - CLEAR */
#define SPI_DORD_SET_gc   (0x20) /* Data Order - SET */


/* Master/Slave Select */
#define SPI_MSTR_CLEAR_gc (0x00) /* Master/Slave Select - CLEAR */
#define SPI_MSTR_SET_gc   (0x10) /* Master/Slave Select - SET */


/* Clock polarity */
#define SPI_CPOL_CLEAR_gc (0x00) /* Clock polarity - CLEAR */
#define SPI_CPOL_SET_gc   (0x08) /* Clock polarity - SET */


/* Clock Phase */
#define SPI_CPHA_CLEAR_gc (0x00) /* Clock Phase - CLEAR */
#define SPI_CPHA_SET_gc   (0x04) /* Clock Phase - SET */


/* SPI Clock Rate Selects */
#define SPI_SPR_VAL_0x00_gc (0x00) /* fcl/4 */
#define SPI_SPR_VAL_0x01_gc (0x01) /* fcl/16 */
#define SPI_SPR_VAL_0x02_gc (0x02) /* fcl/64 */
#define SPI_SPR_VAL_0x03_gc (0x03) /* fcl/128 */


/* SPI Interrupt Flag */
#define SPI_SPIF_CLEAR_gc (0x00) /* SPI Interrupt Flag - CLEAR */
#define SPI_SPIF_SET_gc   (0x80) /* SPI Interrupt Flag - SET */


/* Write Collision Flag */
#define SPI_WCOL_CLEAR_gc (0x00) /* Write Collision Flag - CLEAR */
#define SPI_WCOL_SET_gc   (0x40) /* Write Collision Flag - SET */


/* Double SPI Speed Bit */
#define SPI_SPI2X_CLEAR_gc (0x00) /* Double SPI Speed Bit - CLEAR */
#define SPI_SPI2X_SET_gc   (0x01) /* Double SPI Speed Bit - SET */

#endif

