stevenj/avr-libc3/include/avr/io/attiny40.h
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR      _SFR_MEM8 (0x0031) /* Watchdog Timer Control and Status Register */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_DIDR0       _SFR_MEM8 (0x000D) /* Digital Input Disable Register 0 */
#define ADC_ADC         _SFR_MEM16(0x000E) /* ADC Data Register  Bytes */
#define ADC_ADCL        _SFR_MEM8 (0x000E) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH        _SFR_MEM8 (0x000F) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADMUX       _SFR_MEM8 (0x0010) /* The ADC multiplexer Selection Register */
#define ADC_ADCSRB      _SFR_MEM8 (0x0011) /* ADC Control and Status Register B */
#define ADC_ADCSRA      _SFR_MEM8 (0x0012) /* The ADC Control and Status register */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSRB        _SFR_MEM8 (0x0013) /* Analog Comparator Control And Status Register B */
#define AC_ACSRA        _SFR_MEM8 (0x0014) /* Analog Comparator Control And Status Register A */

/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE        _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWSD        _SFR_MEM8 (0x0028) /* TWI Slave Data Register */
#define TWI_TWSAM       _SFR_MEM8 (0x0029) /* TWI Slave Address Mask Register */
#define TWI_TWSA        _SFR_MEM8 (0x002A) /* TWI Slave Address Register */
#define TWI_TWSSRA      _SFR_MEM8 (0x002B) /* TWI Slave Status Register A */
#define TWI_TWSCRB      _SFR_MEM8 (0x002C) /* TWI Slave Control Register B */
#define TWI_TWSCRA      _SFR_MEM8 (0x002D) /* TWI Slave Control Register A */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_RAMDR       _SFR_MEM8 (0x001F) /* RAM Data Register */
#define CPU_RAMAR       _SFR_MEM8 (0x0020) /* RAM Address Register */
#define CPU_NVMCSR      _SFR_MEM8 (0x0032) /* Non-Volatile Memory Control and Status Register */
#define CPU_NVMCMD      _SFR_MEM8 (0x0033) /* Non-Volatile Memory Command */
#define CPU_PRR         _SFR_MEM8 (0x0035) /* Power Reduction Register */
#define CPU_CLKPSR      _SFR_MEM8 (0x0036) /* Clock Prescale Register */
#define CPU_CLKMSR      _SFR_MEM8 (0x0037) /* Clock Main Settings Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0039) /* Oscillator Calibration Value */
#define CPU_MCUCR       _SFR_MEM8 (0x003A) /* MCU Control Register */
#define CPU_RSTFLR      _SFR_MEM8 (0x003B) /* Reset Flag Register */
#define CPU_CCP         _SFR_MEM8 (0x003C) /* Configuration Change Protection */
#define CPU_SP          _SFR_MEM16(0x003D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x003D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x003E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x003F) /* Status Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK0    _SFR_MEM8 (0x0009) /* Pin Change Mask Register 0 */
#define EXINT_PCMSK1    _SFR_MEM8 (0x000A) /* Pin Change Mask Register 1 */
#define EXINT_GIFR      _SFR_MEM8 (0x000B) /* General Interrupt Flag Register */
#define EXINT_GIMSK     _SFR_MEM8 (0x000C) /* General Interrupt Mask Register */
#define EXINT_PCMSK2    _SFR_MEM8 (0x001A) /* Pin Change Mask Register 2 */
#define EXINT_MCUCR     _SFR_MEM8 (0x003A) /* MCU Control Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0004) /* Port B Data register */
#define PORTBB_DDRB     _SFR_MEM8 (0x0005) /* Data Direction Register, Port B */
#define PORTBB_PORTB    _SFR_MEM8 (0x0006) /* Input Pins, Port B */
#define PORTBB_PUEB     _SFR_MEM8 (0x0007) /* Pull-up Enable Control Register */
#define PORTBB_PORTCR   _SFR_MEM8 (0x0008) /* Port Control Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE     _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PORTCR   _SFR_MEM8 (0x0008) /* Port Control Register */
#define PORTCC_PINC     _SFR_MEM8 (0x001B) /* Port C Input Pins */
#define PORTCC_DDRC     _SFR_MEM8 (0x001C) /* Data Direction Register, Port C */
#define PORTCC_PORTC    _SFR_MEM8 (0x001D) /* Port C Data Register */
#define PORTCC_PUEC     _SFR_MEM8 (0x001E) /* Pull-up Enable Control Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE     _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA     _SFR_MEM8 (0x0000) /* Port A Input Pins */
#define PORTAA_DDRA     _SFR_MEM8 (0x0001) /* Data Direction Register, Port A */
#define PORTAA_PORTA    _SFR_MEM8 (0x0002) /* Port A Data Register */
#define PORTAA_PUEA     _SFR_MEM8 (0x0003) /* Pull-up Enable Control Register */
#define PORTAA_PORTCR   _SFR_MEM8 (0x0008) /* Port Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE        _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_OCR0B       _SFR_MEM8 (0x0015) /* Timer/Counter0 Output Compare Register */
#define TC8_OCR0A       _SFR_MEM8 (0x0016) /* Timer/Counter0 Output Compare Register */
#define TC8_TCNT0       _SFR_MEM8 (0x0017) /* Timer/Counter0 */
#define TC8_TCCR0B      _SFR_MEM8 (0x0018) /* Timer/Counter 0 Control Register B */
#define TC8_TCCR0A      _SFR_MEM8 (0x0019) /* Timer/Counter 0 Control Register A */
#define TC8_OCR1B       _SFR_MEM8 (0x0021) /* Timer/Counter 1 Output Compare Register B */
#define TC8_OCR1A       _SFR_MEM8 (0x0022) /* Timer/Counter 1 Output Compare Register A */
#define TC8_TCNT1L      _SFR_MEM8 (0x0023) /* Timer/Counter1 Low */
#define TC8_TCCR1A      _SFR_MEM8 (0x0024) /* Timer/Counter1 Control Register A */
#define TC8_TIFR        _SFR_MEM8 (0x0025) /* Overflow Interrupt Enable */
#define TC8_TIMSK       _SFR_MEM8 (0x0026) /* Timer Interrupt Mask Register */
#define TC8_TCNT1H      _SFR_MEM8 (0x0027) /* Timer/Counter1 High */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE        _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPDR        _SFR_MEM8 (0x002E) /* SPI Data Register */
#define SPI_SPSR        _SFR_MEM8 (0x002F) /* SPI Status Register */
#define SPI_SPCR        _SFR_MEM8 (0x0030) /* SPI Control Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_BYTE0      _SFR_MEM8 (0x0000) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

