stevenj/avr-libc3/include/avr/io/attiny40.h
/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num      (0)                 
#define None_RESET_vect          _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num       (1)                 
#define None_INT0_vect           _VECTOR(1)          /* External Interrupt Request 0 */
#define None_PCINT0_vect_num     (2)                 
#define None_PCINT0_vect         _VECTOR(2)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num     (3)                 
#define None_PCINT1_vect         _VECTOR(3)          /* Pin Change Interrupt Request 1 */
#define None_PCINT2_vect_num     (4)                 
#define None_PCINT2_vect         _VECTOR(4)          /* Pin Change Interrupt Request 2 */
#define None_WDT_vect_num        (5)                 
#define None_WDT_vect            _VECTOR(5)          /* Watchdog Time-out */
#define None_TIM1_CAPT_vect_num  (6)                 
#define None_TIM1_CAPT_vect      _VECTOR(6)          /* Timer/Counter1 Input Capture */
#define None_TIM1_COMPA_vect_num (7)                 
#define None_TIM1_COMPA_vect     _VECTOR(7)          /*  Timer/Counter1 Compare Match A */
#define None_TIM1_COMPB_vect_num (8)                 
#define None_TIM1_COMPB_vect     _VECTOR(8)          /*  Timer/Counter1 Compare Match B */
#define None_TIM1_OVF_vect_num   (9)                 
#define None_TIM1_OVF_vect       _VECTOR(9)          /* Timer/Counter1 Overflow */
#define None_TIM0_COMPA_vect_num (10)                
#define None_TIM0_COMPA_vect     _VECTOR(10)         /* Timer/Counter0 Compare Match A */
#define None_TIM0_COMPB_vect_num (11)                
#define None_TIM0_COMPB_vect     _VECTOR(11)         /* Timer/Counter0 Compare Match B */
#define None_TIM0_OVF_vect_num   (12)                
#define None_TIM0_OVF_vect       _VECTOR(12)         /* Timer/Counter0 Overflow */
#define None_ANA_COMP_vect_num   (13)                
#define None_ANA_COMP_vect       _VECTOR(13)         /* Analog Comparator */
#define None_ADC_vect_num        (14)                
#define None_ADC_vect            _VECTOR(14)         /* Conversion Complete */
#define None_TWI_SLAVE_vect_num  (15)                
#define None_TWI_SLAVE_vect      _VECTOR(15)         /* Two-Wire Interface */
#define None_SPI_vect_num        (16)                
#define None_SPI_vect            _VECTOR(16)         /* Serial Peripheral Interface */
#define None_QTRIP_vect_num      (17)                
#define None_QTRIP_vect          _VECTOR(17)         /* Touch Sensing */

/* Vector Table Size */
#define _VECTOR_SIZE             (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE            (18 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x1000)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x1000)                           
#define FLASH_PAGE_SIZE (0x0080)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0001)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

#define FUSES_START     (0x0000)                             
#define FUSES_SIZE      (0x0001)                             
#define FUSES_PAGE_SIZE (0x0001)                             
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)       

#define LOCKBITSMEM_START  (0x0000)                                   
#define LOCKBITSMEM_SIZE   (0x0001)                                   
#define LOCKBITSMEM_END    (LOCKBITSMEM_START + LOCKBITSMEM_SIZE - 1) 

#define LOCKBITS_START     (0x0000)                                   
#define LOCKBITS_SIZE      (0x0001)                                   
#define LOCKBITS_PAGE_SIZE (0x0001)                                   
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)       

#define DATAMEM_START                       (0x0000)                                                               
#define DATAMEM_SIZE                        (0x5000)                                                               
#define DATAMEM_END                         (DATAMEM_START + DATAMEM_SIZE - 1)                                     

#define IO_START                            (0x0000)                                                               
#define IO_SIZE                             (0x0040)                                                               
#define IO_PAGE_SIZE                        (0x0001)                                                               
#define IO_END                              (IO_START + IO_SIZE - 1)                                               

#define SRAM_START                          (0x0040)                                                               
#define SRAM_SIZE                           (0x0100)                                                               
#define SRAM_PAGE_SIZE                      (0x0001)                                                               
#define SRAM_END                            (SRAM_START + SRAM_SIZE - 1)                                           

