stevenj/avr-libc3/include/avr/io/attiny40.h
#define MAPPED_NVM_LOCK_BITS_START          (0x3F00)                                                               
#define MAPPED_NVM_LOCK_BITS_SIZE           (0x0002)                                                               
#define MAPPED_NVM_LOCK_BITS_PAGE_SIZE      (0x0001)                                                               
#define MAPPED_NVM_LOCK_BITS_END            (MAPPED_NVM_LOCK_BITS_START + MAPPED_NVM_LOCK_BITS_SIZE - 1)           

#define MAPPED_CONFIGURATION_BITS_START     (0x3F40)                                                               
#define MAPPED_CONFIGURATION_BITS_SIZE      (0x0002)                                                               
#define MAPPED_CONFIGURATION_BITS_PAGE_SIZE (0x0001)                                                               
#define MAPPED_CONFIGURATION_BITS_END       (MAPPED_CONFIGURATION_BITS_START + MAPPED_CONFIGURATION_BITS_SIZE - 1) 

#define MAPPED_CALIBRATION_BITS_START       (0x3F80)                                                               
#define MAPPED_CALIBRATION_BITS_SIZE        (0x0002)                                                               
#define MAPPED_CALIBRATION_BITS_PAGE_SIZE   (0x0001)                                                               
#define MAPPED_CALIBRATION_BITS_END         (MAPPED_CALIBRATION_BITS_START + MAPPED_CALIBRATION_BITS_SIZE - 1)     

#define MAPPED_DEVICE_ID_BITS_START         (0x3FC0)                                                               
#define MAPPED_DEVICE_ID_BITS_SIZE          (0x0004)                                                               
#define MAPPED_DEVICE_ID_BITS_PAGE_SIZE     (0x0001)                                                               
#define MAPPED_DEVICE_ID_BITS_END           (MAPPED_DEVICE_ID_BITS_START + MAPPED_DEVICE_ID_BITS_SIZE - 1)         

#define MAPPED_FLASH_START                  (0x4000)                                                               
#define MAPPED_FLASH_SIZE                   (0x1000)                                                               
#define MAPPED_FLASH_PAGE_SIZE              (0x0001)                                                               
#define MAPPED_FLASH_END                    (MAPPED_FLASH_START + MAPPED_FLASH_SIZE - 1)                           

#define OSCCALMEM_START  (0x0000)                               
#define OSCCALMEM_SIZE   (0x0001)                               
#define OSCCALMEM_END    (OSCCALMEM_START + OSCCALMEM_SIZE - 1) 

#define OSCCAL_START     (0x0000)                               
#define OSCCAL_SIZE      (0x0001)                               
#define OSCCAL_PAGE_SIZE (0x0001)                               
#define OSCCAL_END       (OSCCAL_START + OSCCAL_SIZE - 1)       

/* ============ Port Bits ============ */


#define PB0 (0) 
#define PB1 (1) 
#define PB2 (2) 
#define PB3 (3) 

#define PC0 (0) 
#define PC1 (1) 
#define PC2 (2) 
#define PC3 (3) 
#define PC4 (4) 
#define PC5 (5) 

#define PA0 (0) 
#define PA1 (1) 
#define PA2 (2) 
#define PA3 (3) 
#define PA4 (4) 
#define PA5 (5) 
#define PA6 (6) 
#define PA7 (7) 

/*
================================================================================
Fuses/LockBits/Signatures
================================================================================
*/

/* ============ Fuses ============ */

#define FUSE_MEMORY_SIZE 0 

/* Fuse offset 0x00 */
#define RSTDISBL  (unsigned char)~_BV(0) /* Disable external reset */
#define WDTON     (unsigned char)~_BV(1) /* Watch dog timer always on */
#define CKOUT     (unsigned char)~_BV(2) /* Output external clock */
#define BODLEVEL0 (unsigned char)~_BV(4) /* Brown-out Detector trigger level bit 0 */
#define BODLEVEL1 (unsigned char)~_BV(5) /* Brown-out Detector trigger level bit 1 */
#define BODLEVEL2 (unsigned char)~_BV(6) /* Brown-out Detector trigger level bit 2 */


/* ========== Lock Bits ========== */
#define __LOCK_BITS_EXIST  


/* ========== Signature ========== */
#define SIGNATURE_0 (0x1E) 
#define SIGNATURE_1 (0x92) 
#define SIGNATURE_2 (0x0E) 

#endif /* #ifdef _AVR_ATtiny40_H_INCLUDED */
